IDEA StatiCa Open Model
ReportType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Defines a report type.
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ReportType
Public Enumeration ReportType
public enum class ReportType
Members
Member name | Value | Description
Brief | 0 |  Brief report - only summary is created.
Detailed | 1 |  Detailed report - with all results related to report settings.
See Also
Reference
IdeaRS.OpenModel.Connection Namespace